#ifndef CBITMAP_CELL_H
#define CBITMAP_CELL_H

//====================================================================================================
//описание
//====================================================================================================

// ласс изображени€ в €чейке

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================

#include "stdafx.h"
#include "cicell.h"

//====================================================================================================
//класс изображени€ в €чейке
//====================================================================================================

class CBitmapCell:public CICell
{
 protected:
  CBitmap *cBitmap_Ptr;//выводимое изображение
 public:
  //конструктор
  CBitmapCell(void);
  //деструктор
  ~CBitmapCell();
  //-‘ункции класса----------------------------------------------------------
  void Draw(CDC *pDC,const CRect &cRect_DrawArea);//отрисовка
  void GetSize(CDC *pDC,const CRect &cRect_DrawArea,CSize &cSize);//получить размеры элемента
  void SetBitmap(CBitmap *cBitmap_Ptr_Set);//задать изображение
};

#endif
