#ifndef CDIALOG_TASK_SETTINGS_H
#define CDIALOG_TASK_SETTINGS_H

//====================================================================================================
//описание
//====================================================================================================

//Класс диалога настройки задания

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================
#include "stdafx.h"
#include "cdocument_main.h"
#include "protocol.h"

//====================================================================================================
//класс диалога настройки задания
//====================================================================================================
class CDialog_TaskSettings:public CDialog
{
 protected:
  //-Переменные класса-------------------------------------------------------
  STask sTask_Local;//редактируемое задание
  CDocument_Main *cDocument_Main_Local_Ptr;//указатель на документ
  vector<SUser> vector_SUser_Local;//список пользователей на время редактирования заданий (он ведь может внезапно измениться в документе)
  vector<SProject> vector_SProject_Local;//список проектов на время редактирования заданий (он ведь может внезапно измениться в документе)
  bool NewTask;//создаётся ли новое задание
 public:
  //-Конструктор класса------------------------------------------------------
  CDialog_TaskSettings(LPCTSTR lpszTemplateName,CWnd* pParentWnd);
  //-Деструктор класса-------------------------------------------------------
  ~CDialog_TaskSettings();
  //-Функции-----------------------------------------------------------------
  afx_msg void OnOK(void);//нажали Enter
  afx_msg void OnCancel(void);//нажали ESC
  afx_msg BOOL OnInitDialog(void);//инициализация диалога
  //-Функции класса----------------------------------------------------------
  bool Activate(STask& sTask,CDocument_Main *cDocument_Main_Ptr,bool new_task);//запустить диалог
  //-Функции обработки сообщений класса--------------------------------------
  DECLARE_MESSAGE_MAP()
  afx_msg void OnDestroy(void);//уничтожение окна
  afx_msg void OnCommand_Button_Ok(void);//применить настройки
  afx_msg void OnCommand_Button_Cancel(void);//отменить настройки
  afx_msg void OnCommand_Button_TaskFinished(void);//подтверждение, что задание выполнено
 protected:
  //-Новые функции класса (защищённые)---------------------------------------
  //-Прочее------------------------------------------------------------------  
};
//---------------------------------------------------------------------------
#endif