#ifndef CDIALOG_PROJECT_SETTINGS_H
#define CDIALOG_PROJECT_SETTINGS_H

//====================================================================================================
//описание
//====================================================================================================

//Класс диалога настройки проекта

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================
#include "stdafx.h"
#include "cdocument_main.h"
#include "protocol.h"

//====================================================================================================
//класс диалога настройки проекта
//====================================================================================================
class CDialog_ProjectSettings:public CDialog
{
 protected:
  //-Переменные класса-------------------------------------------------------
  CProject cProject_Local;//редактируемый проект
 public:
  //-Конструктор класса------------------------------------------------------
  CDialog_ProjectSettings(LPCTSTR lpszTemplateName,CWnd* pParentWnd);
  //-Деструктор класса-------------------------------------------------------
  ~CDialog_ProjectSettings();
  //-Функции-----------------------------------------------------------------
  afx_msg void OnOK(void);//нажали Enter
  afx_msg void OnCancel(void);//нажали ESC
  afx_msg BOOL OnInitDialog(void);//инициализация диалога
  //-Функции класса----------------------------------------------------------
  bool Activate(CProject& cProject);//запустить диалог
  //-Функции обработки сообщений класса--------------------------------------
  DECLARE_MESSAGE_MAP()
  afx_msg void OnDestroy(void);//уничтожение окна
  afx_msg void OnCommand_Button_Ok(void);//применить настройки
  afx_msg void OnCommand_Button_Cancel(void);//отменить настройки
 protected:
  //-Новые функции класса (защищённые)---------------------------------------
  //-Прочее------------------------------------------------------------------  
};
//---------------------------------------------------------------------------
#endif