#ifndef CDIALOG_ABOUT_H
#define CDIALOG_ABOUT_H

#include "stdafx.h"

class CDialog_About:public CDialog
{
 protected:
  //-Переменные класса-------------------------------------------------------
  //-Функции класса----------------------------------------------------------
  //-Прочее------------------------------------------------------------------
 public:
  //-Конструктор класса------------------------------------------------------
  CDialog_About(void);
  //-Деструктор класса-------------------------------------------------------
  ~CDialog_About();
  //-Переменные класса-------------------------------------------------------
  //-Замещённые функции предка-----------------------------------------------
  afx_msg void OnOK(void);
  afx_msg void OnClose(void);
  afx_msg void OnCancel(void);
  afx_msg BOOL OnInitDialog(void);
  //-Новые функции класса----------------------------------------------------
  //-Функции обработки сообщений класса--------------------------------------
  DECLARE_MESSAGE_MAP()
 protected:
  //-Новые функции класса----------------------------------------------------
  //-Прочее------------------------------------------------------------------  
};
//---------------------------------------------------------------------------
#endif