#ifndef CDIALOG_DELETE_FINISHED_TASK_H
#define CDIALOG_DELETE_FINISHED_TASK_H

//====================================================================================================
//описание
//====================================================================================================

//Класс диалога удаления выданных вами и завершённых заданий

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================
#include "stdafx.h"
#include "cdocument_main.h"
#include "protocol.h"

//====================================================================================================
//класс диалога удаления выданных вами и завершённых заданий
//====================================================================================================
class CDialog_DeleteFinishedTask:public CDialog
{
 protected:
  //-Переменные класса-------------------------------------------------------
  //дата, до которой включительно нужно удалять завершённые задания
  long Deleted_Year;//год
  long Deleted_Month;//месяц
  long Deleted_Day;//число
 public:
  //-Конструктор класса------------------------------------------------------
  CDialog_DeleteFinishedTask(LPCTSTR lpszTemplateName,CWnd* pParentWnd);
  //-Деструктор класса-------------------------------------------------------
  ~CDialog_DeleteFinishedTask();
  //-Функции-----------------------------------------------------------------
  afx_msg void OnOK(void);//нажали Enter
  afx_msg void OnCancel(void);//нажали ESC
  afx_msg BOOL OnInitDialog(void);//инициализация диалога
  //-Функции класса----------------------------------------------------------
  bool Activate(long &Year,long &Month,long &Day);//запустить диалог
  //-Функции обработки сообщений класса--------------------------------------
  DECLARE_MESSAGE_MAP()
  afx_msg void OnDestroy(void);//уничтожение окна
  afx_msg void OnCommand_Button_Delete(void);//удалить
  afx_msg void OnCommand_Button_Cancel(void);//отмена
 protected:
  //-Новые функции класса (защищённые)---------------------------------------
  //-Прочее------------------------------------------------------------------  
};
//---------------------------------------------------------------------------
#endif