#ifndef CDIALOG_CLIENT_SETTINGS_H
#define CDIALOG_CLIENT_SETTINGS_H

//====================================================================================================
//описание
//====================================================================================================

//Класс диалога настройки клиента

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================
#include "stdafx.h"
#include "cdocument_main.h"

//====================================================================================================
//класс диалога настройки клиента
//====================================================================================================
class CDialog_ClientSettings:public CDialog
{
 protected:
  //-Переменные класса-------------------------------------------------------
  SClientSettings sClientSettings_Local;//редактируемые настройки
 public:
  //-Конструктор класса------------------------------------------------------
  CDialog_ClientSettings(LPCTSTR lpszTemplateName,CWnd* pParentWnd);
  //-Деструктор класса-------------------------------------------------------
  ~CDialog_ClientSettings();
  //-Функции-----------------------------------------------------------------
  afx_msg void OnOK(void);//нажали Enter
  afx_msg void OnCancel(void);//нажали ESC
  afx_msg BOOL OnInitDialog(void);//инициализация диалога
  //-Функции класса----------------------------------------------------------
  bool Activate(SClientSettings& sClientSettings);//запустить диалог
  //-Функции обработки сообщений класса--------------------------------------
  DECLARE_MESSAGE_MAP()
  afx_msg void OnDestroy(void);//уничтожение окна
  afx_msg void OnCommand_Button_Ok(void);//применить настройки
  afx_msg void OnCommand_Button_Cancel(void);//отменить настройки
 protected:
  //-Новые функции класса (защищённые)---------------------------------------
  //-Прочее------------------------------------------------------------------  
};
//---------------------------------------------------------------------------
#endif