#ifndef CFILL_CELL_H
#define CFILL_CELL_H

//====================================================================================================
//описание
//====================================================================================================

// ласс закрашенной €чейки

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================

#include "stdafx.h"
#include "cicell.h"

//====================================================================================================
//класс закрашенной €чейки
//====================================================================================================

class CFillCell:public CICell
{
 protected:
  COLORREF BackgroundColor;//цвет фона
 public:
  //конструктор
  CFillCell(void);
  //деструктор
  ~CFillCell();
  //-‘ункции класса----------------------------------------------------------
  void Draw(CDC *pDC,const CRect &cRect_DrawArea);//отрисовка
  void GetSize(CDC *pDC,const CRect &cRect_DrawArea,CSize &cSize);//получить размеры элемента
  void SetBackgroundColor(const COLORREF &color);//задать цвет фона
};

#endif
