#ifndef CFRAME_CELL_H
#define CFRAME_CELL_H

//====================================================================================================
//описание
//====================================================================================================

// ласс границы €чейки

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================

#include "stdafx.h"
#include "cicell.h"

//====================================================================================================
//класс границы €чейки
//====================================================================================================

class CFrameCell:public CICell
{
 protected:
  COLORREF BorderColor;//цвет границы
 public:
  //конструктор
  CFrameCell(void);
  //деструктор
  ~CFrameCell();
  //-‘ункции класса----------------------------------------------------------
  void Draw(CDC *pDC,const CRect &cRect_DrawArea) override;//отрисовка
  void GetSize(CDC *pDC,const CRect &cRect_DrawArea,CSize &cSize) override;//получить размеры элемента
  void SetBorderColor(const COLORREF &color);//задать цвет границы
};

#endif
