#ifndef CITASK_EXPORT_H
#define CITASK_EXPORT_H

//====================================================================================================
//описание
//====================================================================================================

//Абстрактный класс экспорта заданий

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================
#include "stdafx.h"
#include "csafestring.h"

#include "ctask.h"
#include "cuser.h"
#include "cproject.h"

#include <list>


//====================================================================================================
//абстрактный класс экспорта заданий
//====================================================================================================

class CITaskExport
{
 public:
  //деструктор
  virtual ~CITaskExport() {};
  //-Функции класса----------------------------------------------------------
  virtual bool Export(const CString &file_name,const std::list<CTask> &list_CTask,const std::list<CUser> &list_CUser,const std::list<CProject> &list_CProject)=0;//экспортировать задания

  static CITaskExport* CreateNewTaskExportToHTML(void);//создать класс экспорта в html
  static CITaskExport* CreateNewTaskExportToCSV(void);//создать класс экспорта в csv
};

#endif
