#ifndef CPROJECT_H
#define CPROJECT_H

//====================================================================================================
//описание
//====================================================================================================

//Класс проектов

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================
#include "stdafx.h"
#include "csafestring.h"
//====================================================================================================
//макроопределения
//====================================================================================================

//тип проекта
enum PROJECT_TYPE
{
 //нет типа
 PROJECT_TYPE_NONE,
 //проект на удаление
 PROJECT_TYPE_DELETED,
 //проект на изменение
 PROJECT_TYPE_CHANGED,
 //проект на добавление
 PROJECT_TYPE_ADDED
};


//====================================================================================================
//класс проектов
//====================================================================================================
class CProject
{
 private:
  //заголовок для загрузки и сохранения данных
  #pragma pack(1)
  struct SHeader
  {
   unsigned long ProjectNameSize;//задание
   unsigned long ProjectGUIDSize;//идентификатор задания
   PROJECT_TYPE ProjectType;//тип проекта
  };
  #pragma pack()

  CSafeString ProjectName;//название проекта
  CSafeString ProjectGUID;//уникальный идентификатор  
  //дополнительные данные
  PROJECT_TYPE ProjectType;//тип проекта
  bool ChangeData;//изменились данные проекта
  //-Переменные класса-------------------------------------------------------
 public:
  //-Конструктор класса------------------------------------------------------
  CProject(void);
  //-Деструктор класса-------------------------------------------------------
  ~CProject();
  //-Функции класса----------------------------------------------------------
  const CSafeString& GetProjectName(void) const;//получить название
  const CSafeString& GetProjectGUID(void) const;//получить уникальный идентификатор
  const bool& GetChangeData(void) const;//получить, изменились ли данные проекта
  const PROJECT_TYPE& GetProjectType(void) const;//получить тип проекта

  void SetProjectName(const char *project_name);//задать название
  void SetProjectGUID(const char *guid);//задать уникальный идентификатор
  void SetChangeData(const bool& change_data);//задать изменились ли данные проекта
  void SetProjectType(PROJECT_TYPE project_type);//задать тип проекта

  bool IsProjectGUID(const char *guid);//верный ли ProjectGUID

  bool Save(FILE *file) const;//сохранить данные
  bool Load(FILE *file);//загрузить данные
};
#endif
