#include "cproject.h"

//====================================================================================================
//конструктор класса
//====================================================================================================
CProject::CProject(void)
{
 ProjectName="";
 ProjectGUID="";
}
//====================================================================================================
//деструктор класса
//====================================================================================================
CProject::~CProject()
{		
}
//====================================================================================================
//функции класса
//====================================================================================================

//----------------------------------------------------------------------------------------------------
//получить название
//----------------------------------------------------------------------------------------------------
const CSafeString& CProject::GetProjectName(void) const
{
 return(ProjectName);
}
//----------------------------------------------------------------------------------------------------
//получить уникальный идентификатор
//----------------------------------------------------------------------------------------------------
const CSafeString& CProject::GetProjectGUID(void) const
{
 return(ProjectGUID);
}
//----------------------------------------------------------------------------------------------------
//получить, изменились ли данные проекта
//----------------------------------------------------------------------------------------------------
const bool& CProject::GetChangeData(void) const
{
 return(ChangeData);
}
//----------------------------------------------------------------------------------------------------
//получить тип проекта
//----------------------------------------------------------------------------------------------------
const PROJECT_TYPE& CProject::GetProjectType(void) const
{
 return(ProjectType);
}
//----------------------------------------------------------------------------------------------------
//задать название
//----------------------------------------------------------------------------------------------------
void CProject::SetProjectName(const char *project_name)
{
 ProjectName=project_name;
}
//----------------------------------------------------------------------------------------------------
//задать уникальный идентификатор
//----------------------------------------------------------------------------------------------------
void CProject::SetProjectGUID(const char *guid)
{
 ProjectGUID=guid;
}
//----------------------------------------------------------------------------------------------------
//задать изменились ли данные проекта
//----------------------------------------------------------------------------------------------------
void CProject::SetChangeData(const bool& change_data)
{
 ChangeData=change_data;
}
//----------------------------------------------------------------------------------------------------
//задать тип проекта
//----------------------------------------------------------------------------------------------------
void CProject::SetProjectType(PROJECT_TYPE project_type)
{
 ProjectType=project_type;
}

//----------------------------------------------------------------------------------------------------
//верный ли ProjectGUID
//----------------------------------------------------------------------------------------------------
bool CProject::IsProjectGUID(const char *guid)
{
 if (ProjectGUID.Compare(const_cast<char*>(guid))==0) return(true);    
 return(false);
}
//----------------------------------------------------------------------------------------------------
//сохранить данные
//----------------------------------------------------------------------------------------------------
bool CProject::Save(FILE *file) const
{
 //заполняем заголовок
 SHeader sHeader;
 sHeader.ProjectNameSize=ProjectName.GetLength();
 sHeader.ProjectGUIDSize=ProjectGUID.GetLength();
 sHeader.ProjectType=ProjectType;
 fwrite(reinterpret_cast<const char*>(&sHeader),sizeof(SHeader),1,file);
 const char *s_ptr;
 s_ptr=ProjectName;
 fwrite(s_ptr,ProjectName.GetLength(),1,file);
 s_ptr=ProjectGUID;
 fwrite(s_ptr,ProjectGUID.GetLength(),1,file);
 return(true);
}
//----------------------------------------------------------------------------------------------------
//загрузить данные
//----------------------------------------------------------------------------------------------------
bool CProject::Load(FILE *file)
{
 SHeader sHeader;
 fread(&sHeader,sizeof(SHeader),1,file);
 char *project_guid=new char[sHeader.ProjectGUIDSize+1];
 char *project_name=new char[sHeader.ProjectNameSize+1];
 
 fread(project_name,sizeof(char),sHeader.ProjectNameSize,file);
 fread(project_guid,sizeof(char),sHeader.ProjectGUIDSize,file);  
 
 project_name[sHeader.ProjectNameSize]=0;
 project_guid[sHeader.ProjectGUIDSize]=0;

 ProjectName=project_name;
 ProjectGUID=project_guid;
 ProjectType=sHeader.ProjectType;

 delete[](project_name);
 delete[](project_guid);
 return(true);
}
