#include "ctask.h"

//====================================================================================================
//конструктор класса
//====================================================================================================
CTask::CTask(void)
{
 Index=0;
 ForUserGUID="";
 FromUserGUID="";
 ProjectGUID="";
 TaskGUID="";
 Task="";
 State=TASK_STATE_NO_READ;
 cDate.SetDate(0,0,0);
 Answer="";
}
//====================================================================================================
//деструктор класса
//====================================================================================================
CTask::~CTask()
{		
}
//====================================================================================================
//функции класса
//====================================================================================================

//----------------------------------------------------------------------------------------------------
//получиь индекс
//----------------------------------------------------------------------------------------------------
const long& CTask::GetIndex(void) const
{
 return(Index);
}
//----------------------------------------------------------------------------------------------------
//получить уникальный идентификатор от какого пользователя задание
//----------------------------------------------------------------------------------------------------
const CSafeString& CTask::GetFromUserGUID(void) const
{
 return(FromUserGUID);
}
//----------------------------------------------------------------------------------------------------
//получить уникальный идентификатор для какого пользователя задание
//----------------------------------------------------------------------------------------------------
const CSafeString& CTask::GetForUserGUID(void) const
{
 return(ForUserGUID);
}
//----------------------------------------------------------------------------------------------------
//получить уникальный идентификатор проекта
//----------------------------------------------------------------------------------------------------
const CSafeString& CTask::GetProjectGUID(void) const
{
 return(ProjectGUID);
}
//----------------------------------------------------------------------------------------------------
//получить задание
//----------------------------------------------------------------------------------------------------
const CSafeString& CTask::GetTask(void) const
{
 return(Task);
}
//----------------------------------------------------------------------------------------------------
//получиь состояние задания
//----------------------------------------------------------------------------------------------------
const long& CTask::GetState(void) const
{
 return(State);
}
//----------------------------------------------------------------------------------------------------
//получить срок задания
//----------------------------------------------------------------------------------------------------
const CDate& CTask::GetDate(void) const
{
 return(cDate);
}
//----------------------------------------------------------------------------------------------------
//получить уникальный идентификатор задания
//----------------------------------------------------------------------------------------------------
const CSafeString& CTask::GetTaskGUID(void) const
{
 return(TaskGUID);
}
//----------------------------------------------------------------------------------------------------
//получить ответ на задание
//----------------------------------------------------------------------------------------------------
const CSafeString& CTask::GetAnswer(void) const
{
 return(Answer);
}
//----------------------------------------------------------------------------------------------------
//получить, изменились ли данные задания
//----------------------------------------------------------------------------------------------------
const bool& CTask::GetChangeData(void) const
{
 return(ChangeData);
}
//----------------------------------------------------------------------------------------------------
//получить тип задания
//----------------------------------------------------------------------------------------------------
const TASK_TYPE& CTask::GetTaskType(void) const
{
 return(TaskType);
}
//----------------------------------------------------------------------------------------------------
//получить имя пользователя для которого задание
//----------------------------------------------------------------------------------------------------
const CSafeString& CTask::GetForUser(void) const
{
 return(ForUser);
}
//----------------------------------------------------------------------------------------------------
//получить имя пользователя от которого задание
//----------------------------------------------------------------------------------------------------
const CSafeString& CTask::GetFromUser(void) const
{
 return(FromUser);
}

//----------------------------------------------------------------------------------------------------
//задать индекс
//----------------------------------------------------------------------------------------------------
void CTask::SetIndex(const long& index)
{
 Index=index;
}
//----------------------------------------------------------------------------------------------------
//задать уникальный идентификатор от какого пользователя задание
//----------------------------------------------------------------------------------------------------
void CTask::SetFromUserGUID(const char *from_user_guid)
{
 FromUserGUID=from_user_guid;
}
//----------------------------------------------------------------------------------------------------
//задать уникальный идентификатор для какого пользователя задание
//----------------------------------------------------------------------------------------------------
void CTask::SetForUserGUID(const char *for_user_guid)
{
 ForUserGUID=for_user_guid;
}
//----------------------------------------------------------------------------------------------------
//задать уникальный идентификатор проекта
//----------------------------------------------------------------------------------------------------
void CTask::SetProjectGUID(const char *project_guid)
{
 ProjectGUID=project_guid;
}
//----------------------------------------------------------------------------------------------------
//задать задание
//----------------------------------------------------------------------------------------------------
void CTask::SetTask(const char *task)
{
 Task=task;
}
//----------------------------------------------------------------------------------------------------
//получиь состояние задания
//----------------------------------------------------------------------------------------------------
void CTask::SetState(const long &state)
{
 State=state;
}
//----------------------------------------------------------------------------------------------------
//задать срок задания
//----------------------------------------------------------------------------------------------------
void CTask::SetDate(const CDate &cDate_Set)
{
 cDate=cDate_Set;
}
//----------------------------------------------------------------------------------------------------
//задать уникальный идентификатор задания
//----------------------------------------------------------------------------------------------------
void CTask::SetTaskGUID(const char *task_guid)
{
 TaskGUID=task_guid;
}
//----------------------------------------------------------------------------------------------------
//задать ответ на задание
//----------------------------------------------------------------------------------------------------
void CTask::SetAnswer(const char *answer)
{
 Answer=answer;
}
//----------------------------------------------------------------------------------------------------
//задать изменились ли данные задания
//----------------------------------------------------------------------------------------------------
void CTask::SetChangeData(const bool& change_data)
{
 ChangeData=change_data;
}
//----------------------------------------------------------------------------------------------------
//задать тип задания
//----------------------------------------------------------------------------------------------------
void CTask::SetTaskType(TASK_TYPE task_type)
{
 TaskType=task_type;
}
//----------------------------------------------------------------------------------------------------
//задать имя пользователя для которого задание
//----------------------------------------------------------------------------------------------------
void CTask::SetForUser(const char *for_user)
{
 ForUser=for_user;
}
//----------------------------------------------------------------------------------------------------
//задать имя пользователя от которого задание
//----------------------------------------------------------------------------------------------------
void CTask::SetFromUser(const char *from_user)
{
 FromUser=from_user;
}

//----------------------------------------------------------------------------------------------------
//это задание от или для пользователя с уникальным идентификатором
//----------------------------------------------------------------------------------------------------
bool CTask::IsFromOrForUserGUID(const char *guid) const
{
 if (ForUserGUID.Compare(const_cast<char*>(guid))==0 || FromUserGUID.Compare(const_cast<char*>(guid))==0) return(true);
 return(false);
}
//----------------------------------------------------------------------------------------------------
//это задание для пользователя с уникальным идентификатором
//----------------------------------------------------------------------------------------------------
bool CTask::IsForUserGUID(const char *guid) const
{
 if (ForUserGUID.Compare(const_cast<char*>(guid))==0) return(true);
 return(false);
}
//----------------------------------------------------------------------------------------------------
//это задание от пользователя с уникальным идентификатором
//----------------------------------------------------------------------------------------------------
bool CTask::IsFromUserGUID(const char *guid) const
{
 if (FromUserGUID.Compare(const_cast<char*>(guid))==0) return(true);
 return(false);
}
//----------------------------------------------------------------------------------------------------
//это задание по проекту с уникальным идентификатором
//----------------------------------------------------------------------------------------------------
bool CTask::IsProjectGUID(const char *guid) const
{
 if (ProjectGUID.Compare(const_cast<char*>(guid))==0) return(true);
 return(false);
}
//----------------------------------------------------------------------------------------------------
//верный ли TaskGUID
//----------------------------------------------------------------------------------------------------
bool CTask::IsTaskGUID(const char *guid) const
{
 if (TaskGUID.Compare(const_cast<char*>(guid))==0) return(true);    
 return(false);
}


//----------------------------------------------------------------------------------------------------
//сохранить данные
//----------------------------------------------------------------------------------------------------
bool CTask::Save(FILE *file) const
{
 //заполняем заголовок
 SHeader sHeader;
 sHeader.FromUserGUIDSize=FromUserGUID.GetLength();
 sHeader.ForUserGUIDSize=ForUserGUID.GetLength();
 sHeader.ProjectGUIDSize=ProjectGUID.GetLength();
 sHeader.TaskSize=Task.GetLength();
 sHeader.TaskGUIDSize=TaskGUID.GetLength();
 sHeader.AnswerSize=Answer.GetLength();
 sHeader.Year=cDate.GetYear();
 sHeader.Month=cDate.GetMonth();
 sHeader.Day=cDate.GetDay();
 sHeader.State=State;
 sHeader.TaskType=TaskType;
 sHeader.Index=Index;
 fwrite(reinterpret_cast<const char*>(&sHeader),sizeof(SHeader),1,file);
 const char *s_ptr;
 s_ptr=FromUserGUID;
 fwrite(s_ptr,FromUserGUID.GetLength(),1,file);
 s_ptr=ForUserGUID;
 fwrite(s_ptr,ForUserGUID.GetLength(),1,file);
 s_ptr=ProjectGUID;
 fwrite(s_ptr,ProjectGUID.GetLength(),1,file);
 s_ptr=Task;
 fwrite(s_ptr,Task.GetLength(),1,file);
 s_ptr=TaskGUID;
 fwrite(s_ptr,TaskGUID.GetLength(),1,file);
 s_ptr=Answer;
 fwrite(s_ptr,Answer.GetLength(),1,file);
 return(true);
}
//----------------------------------------------------------------------------------------------------
//загрузить данные
//----------------------------------------------------------------------------------------------------
bool CTask::Load(FILE *file)
{
 SHeader sHeader;
 fread(&sHeader,sizeof(SHeader),1,file);
 char *from_user_guid=new char[sHeader.FromUserGUIDSize+1];
 char *for_user_guid=new char[sHeader.ForUserGUIDSize+1];
 char *project_guid=new char[sHeader.ProjectGUIDSize+1];
 char *task=new char[sHeader.TaskSize+1];
 char *task_guid=new char[sHeader.TaskGUIDSize+1];
 char *answer=new char[sHeader.AnswerSize+1];
 
 fread(from_user_guid,sizeof(char),sHeader.FromUserGUIDSize,file);
 fread(for_user_guid,sizeof(char),sHeader.ForUserGUIDSize,file);
 fread(project_guid,sizeof(char),sHeader.ProjectGUIDSize,file);
 fread(task,sizeof(char),sHeader.TaskSize,file);
 fread(task_guid,sizeof(char),sHeader.TaskGUIDSize,file);
 fread(answer,sizeof(char),sHeader.AnswerSize,file);
 
 from_user_guid[sHeader.FromUserGUIDSize]=0;
 for_user_guid[sHeader.ForUserGUIDSize]=0;
 project_guid[sHeader.ProjectGUIDSize]=0;
 task[sHeader.TaskSize]=0;
 task_guid[sHeader.TaskGUIDSize]=0;
 answer[sHeader.AnswerSize]=0;

 FromUserGUID=from_user_guid;
 ForUserGUID=for_user_guid;
 ProjectGUID=project_guid;
 Task=task;
 TaskGUID=task_guid;
 Answer=answer;

 State=sHeader.State;
 cDate.SetDate(sHeader.Year,sHeader.Month,sHeader.Day);
 TaskType=sHeader.TaskType;
 Index=sHeader.Index;

 delete[](from_user_guid);
 delete[](for_user_guid);
 delete[](project_guid);
 delete[](task);
 delete[](task_guid);
 delete[](answer);

 return(true);
}
