#ifndef CUNIQUE_PTR
#define CUNIQUE_PTR

//====================================================================================================
//описание
//====================================================================================================

//Класс умного указателя для одиночных элементов

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================


//====================================================================================================
//класс умного указателя
//====================================================================================================
template<class C>
class CUniquePtr
{
 private:
  C *c_Ptr;//указатель на класс 	
 public:
  CUniquePtr()//конструктор
  {
   c_Ptr=NULL;  	
  }
 ~CUniquePtr()//деструктор
  {
   if (c_Ptr!=NULL) delete(c_Ptr); 	
   c_Ptr=NULL;
  }
 public: 
  C* Get(void)//получить указатель на объект
  {
   return(c_Ptr);
  }
 void Set(C *c_Ptr_Set)//задать указатель на объект
  {
   c_Ptr=c_Ptr_Set;
  }
 //запрещаем операции копирования и присваивания 
 private:
  CUniquePtr(const CUniquePtr<C> &cUniquePtr){};//конструктор копирования запрещён
  CUniquePtr<C>& operator=(const CUniquePtr<C>& cUniquePtr){return(*this);}//оператор "="
};

#endif